УТ_для_edt.РасширениеСмарт/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Пользователи</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="84450f4c-12f4-48e1-92d7-52e1fec0d1f1">
    <name>смартМенеджерСайта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="58a4348b-43e7-46fb-966f-fdf2e9858abd">
    <name>смартРабочаяПочта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9984e2d4-a5d7-4891-bd52-251aae7eea37">
    <name>смартРабочийТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Skype</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Факс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Пользователи/ObjectModule.bsl
#Область ПеренесеноСДоработкамиСмарт

&После("ПриКопировании")
Процедура смарт_ПриКопировании(ОбъектКопирования)

	//++#1352 смарт: Лопато 04.05.2023 //Звонки из 1С (через городской стационарный телефон)  
	смартРабочаяПочта 		 = Неопределено;
	смартРабочийТелефон 	 = Неопределено;
	смартВнутреннийНомерВАТС = Неопределено;
	//--#1352 смарт: Лопато 04.05.2023
	
	//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров
	смартВнутреннийНомерВАТСДополнительный = Неопределено;
	//-- #Б-6744 смарт: Фролов 28.05.2026

КонецПроцедуры

&ИзменениеИКонтроль("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовый = ЭтоНовый();
	
	ПользователиСлужебный.НачатьОбработкуПользователяИБ(ЭтотОбъект, ПараметрыОбработкиПользователяИБ);
	
	#Вставка
	//++#1651 смарт: Лопато 25.03.2024 //Телефония. Хранение истории контактной информации пользователей  
	смартПроверитьДобавитьКонтактнуюИнформациюРабочиеТелефоны(ЭтотОбъект);
											 
	смартПроверитьКонтактнаяИнформацияПринадлежитДругимПользователям(ЭтотОбъект, Отказ)
	//--#1651 смарт: Лопато 25.03.2024
	#КонецВставки
	
КонецПроцедуры

&ИзменениеИКонтроль("ПриЗаписи")
Процедура смарт_ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ГруппаНовогоПользователя")
		И ЗначениеЗаполнено(ДополнительныеСвойства.ГруппаНовогоПользователя) Тогда
		
		Блокировка = Новый БлокировкаДанных;
		Блокировка.Добавить("Справочник.ГруппыПользователей");
		Блокировка.Заблокировать();
		
		ОбъектГруппы = ДополнительныеСвойства.ГруппаНовогоПользователя.ПолучитьОбъект(); // СправочникОбъект.ГруппыПользователей
		ОбъектГруппы.Состав.Добавить().Пользователь = Ссылка;
		ОбъектГруппы.Записать();
	КонецЕсли;
	
	// Обновление состава автоматической группы "Все пользователи".
	УчастникиИзменений = Новый Соответствие;
	ИзмененныеГруппы   = Новый Соответствие;
	
	ПользователиСлужебный.ОбновитьСоставыГруппПользователей(
		Справочники.ГруппыПользователей.ВсеПользователи, Ссылка, УчастникиИзменений, ИзмененныеГруппы);
	
	ПользователиСлужебный.ОбновитьИспользуемостьСоставовГруппПользователей(
		Ссылка, УчастникиИзменений, ИзмененныеГруппы);
	
	ПользователиСлужебный.ЗавершитьОбработкуПользователяИБ(
		ЭтотОбъект, ПараметрыОбработкиПользователяИБ);
	
	ПользователиСлужебный.ПослеОбновленияСоставовГруппПользователей(
		УчастникиИзменений, ИзмененныеГруппы);
	
	ПользователиСлужебный.ВключитьЗаданиеКонтрольАктивностиПользователейПриНеобходимости(Ссылка);
	
	ИнтеграцияПодсистемБСП.ПослеДобавленияИзмененияПользователяИлиГруппы(Ссылка, ЭтоНовый);

	#Вставка
	//++#1651 смарт: Лопато 25.03.2024 //Телефония. Хранение истории контактной информации пользователей  
	РегистрыСведений.смартИсторияКонтактнойИнформацииПользователей.ЗаписатьИсториюКонтактнойИнформацииПользователя(ЭтотОбъект.Ссылка, ЭтотОбъект.КонтактнаяИнформация.Выгрузить());
	//--#1651 смарт: Лопато 25.03.2024
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

//++#1651 смарт: Лопато 25.03.2024 //Телефония. Хранение истории контактной информации пользователей  
Процедура смартПроверитьДобавитьКонтактнуюИнформациюРабочиеТелефоны(ОбъектКонтактнойИнформации)

	ВидКонтактнойИнформацииРабочийТелефон 	   = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.смартРабочийТелефон");
	ВидКонтактнойИнформацииВнутреннийНомерВАТС = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.смартВнутреннийНомерВАТС");
	//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров
	ВидКонтактнойИнформацииВнутреннийНомерВАТСДополнительный = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.смартВнутреннийНомерВАТСДополнительный");
	//-- #Б-6744 смарт: Фролов 28.05.2026
	
	ВидыКонтактнойИнформации = Новый Массив;
	ВидыКонтактнойИнформации.Добавить(ВидКонтактнойИнформацииРабочийТелефон);
	ВидыКонтактнойИнформации.Добавить(ВидКонтактнойИнформацииВнутреннийНомерВАТС);
	//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров
	ВидыКонтактнойИнформации.Добавить(ВидКонтактнойИнформацииВнутреннийНомерВАТСДополнительный);
	//-- #Б-6744 смарт: Фролов 28.05.2026
	
	КонтактнаяИнформацияПользователя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(ОбъектКонтактнойИнформации, 
																									Перечисления.ТипыКонтактнойИнформации.Телефон, 
																									ВидыКонтактнойИнформации, 
																									ТекущаяДата());
																									
    смартДобавитьВКонтактнуюИнформациюТелефонИзРеквизита(ОбъектКонтактнойИнформации, КонтактнаяИнформацияПользователя, 
											 			 ОбъектКонтактнойИнформации.смартРабочийТелефон, ВидКонтактнойИнформацииРабочийТелефон);

    смартДобавитьВКонтактнуюИнформациюТелефонИзРеквизита(ОбъектКонтактнойИнформации, КонтактнаяИнформацияПользователя, 
											 			 ОбъектКонтактнойИнформации.смартВнутреннийНомерВАТС, ВидКонтактнойИнформацииВнутреннийНомерВАТС);
														 
	//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров
	смартДобавитьВКонтактнуюИнформациюТелефонИзРеквизита(ОбъектКонтактнойИнформации, КонтактнаяИнформацияПользователя, 
											 			 ОбъектКонтактнойИнформации.смартВнутреннийНомерВАТСДополнительный, ВидКонтактнойИнформацииВнутреннийНомерВАТСДополнительный);
	//-- #Б-6744 смарт: Фролов 28.05.2026
	
КонецПроцедуры //--#1651 смарт: Лопато 25.03.2024

//++#1651 смарт: Лопато 25.03.2024 //Телефония. Хранение истории контактной информации пользователей  
Процедура смартДобавитьВКонтактнуюИнформациюТелефонИзРеквизита(ОбъектКонтактнойИнформации, ТаблицаКонтактнаяИнформация,НомерТелефона, ВидКонтактнойИнформации)
	
	Если ЗначениеЗаполнено(НомерТелефона) Тогда
		
		СтрокиКонтактнойИнформации = ТаблицаКонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", ВидКонтактнойИнформации));
	
		Если СтрокиКонтактнойИнформации.Количество() = 0 Тогда
			
			УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ОбъектКонтактнойИнформации, 
																		 НомерТелефона, 
																		 ВидКонтактнойИнформации
																		 , 
																		 , 
																		 Ложь);
			
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры //--#1651 смарт: Лопато 25.03.2024

//++#1651 смарт: Лопато 25.03.2024 //Телефония. Хранение истории контактной информации пользователей  
Процедура смартПроверитьКонтактнаяИнформацияПринадлежитДругимПользователям(ОбъектКонтактнойИнформации, Отказ)
	
	УстановитьПривилегированныйРежим(Истина);

	МассивКонтактнаяИнформацияТелефоны = ОбъектКонтактнойИнформации.КонтактнаяИнформация.ВыгрузитьКолонку("НомерТелефона");
	
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивКонтактнаяИнформацияТелефоны, "");
	
	Если МассивКонтактнаяИнформацияТелефоны.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ТекущийПользователь", ОбъектКонтактнойИнформации.Ссылка);
	Запрос.УстановитьПараметр("Тип", 				 Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("НомераТелефонов", 	 МассивКонтактнаяИнформацияТелефоны);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПользователиКонтактнаяИнформация.Ссылка КАК ПользовательСсылка,
	|	ПользователиКонтактнаяИнформация.Вид КАК Вид,
	|	ПользователиКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|ГДЕ
	|	ПользователиКонтактнаяИнформация.Тип = &Тип
	|	И ПользователиКонтактнаяИнформация.Ссылка <> &ТекущийПользователь
	|	И ПользователиКонтактнаяИнформация.НомерТелефона В(&НомераТелефонов)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ТекстОшибки = "При проверке контактной информации произошли ошибки:";
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ТекстОшибки = ТекстОшибки + Символы.ПС + "Номер телефона "  + СокрЛП(Выборка.НомерТелефона) 
												   + " указан как " 	+ СокрЛП(Выборка.Вид) 
												   + " у пользователя " + СокрЛП(Выборка.ПользовательСсылка);
			
		КонецЦикла;
		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		
    КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры //--#1651 смарт: Лопато 25.03.2024

#КонецОбласти
